tutorials/adsorbTestProblem/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          1225;
        startFace       685075;
    }
    outlet
    {
        type            patch;
        nFaces          1225;
        startFace       686300;
    }
    sides
    {
        type            patch;
        nFaces          7700;
        startFace       687525;
    }
    fluid_to_solid
    {
        type            patch;
        nFaces          11312;
        startFace       695225;
    }
)


// ************************************************************************* //
