tutorials/adsorbTestProblem/constant/fluid/faMesh/faceLabels
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelList;
    location    "constant/faMesh";
    object      faceLabels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


11312
(
695225
695226
695227
695228
695229
695230
695231
695232
695233
695234
695235
695236
695237
695238
695239
695240
695241
695242
695243
695244
695245
695246
695247
695248
695249
695250
695251
695252
695253
695254
695255
695256
695257
695258
695259
695260
695261
695262
695263
695264
695265
695266
695267
695268
695269
695270
695271
695272
695273
695274
695275
695276
695277
695278
695279
695280
695281
695282
695283
695284
695285
695286
695287
695288
695289
695290
695291
695292
695293
695294
695295
695296
695297
695298
695299
695300
695301
695302
695303
695304
695305
695306
695307
695308
695309
695310
695311
695312
695313
695314
695315
695316
695317
695318
695319
695320
695321
695322
...
)


// ************************************************************************* //
