tutorials/adsorbTestProblem/constant/regionInterfacePropertiesPartitioned
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      regionInterfaceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

partitionedCoupledPatches
(
    fluidsolid
    {
        interfaceType defaultInterface;

        coupledPatchPair
        (
            (fluid fluid_to_solid)
            (solid solid_to_fluid)
        );

        coupledFields
        (
	    T
	    CO2
	    H2O
        );
    }
);

monolithicCoupledPatches
(
);

curvatureCorrectedSurfacePatches 0();

interpolatorUpdateFrequency 1;

interfaceTransferMethod GGI;

directMapCoeffs
{}

GGICoeffs
{}

// ************************************************************************* //
