tutorials/adsorbTestProblem/constant/solid/faMesh/faceLabels
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelList;
    location    "constant/faMesh";
    object      faceLabels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


10856
(
410260
410261
410262
410263
410264
410265
410266
410267
410268
410269
410270
410271
410272
410273
410274
410275
410276
410277
410278
410279
410280
410281
410282
410283
410284
410285
410286
410287
410288
410289
410290
410291
410292
410293
410294
410295
410296
410297
410298
410299
410300
410301
410302
410303
410304
410305
410306
410307
410308
410309
410310
410311
410312
410313
410314
410315
410316
410317
410318
410319
410320
410321
410322
410323
410324
410325
410326
410327
410328
410329
410330
410331
410332
410333
410334
410335
410336
410337
410338
410339
410340
410341
410342
410343
410344
410345
410346
410347
410348
410349
410350
410351
410352
410353
410354
410355
410356
410357
...
)


// ************************************************************************* //
