tutorials/adsorbTestProblem/0/fluid/CO2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
    fluid_to_solid
    {
        type                    regionCoupledScalarFlux; //regionCoupledScalarJump;
        interfaceType           defaultInterface;
        k                       "DCO2";
        accType                 fixed;
        relax                   1.0;
        neighbourRegionName     solid;
        neighbourPatchName      solid_to_fluid;
        neighbourFieldName      CO2;
        secondOrder             false;
        nonOrthCorr             true;
        value                   $internalField;
    }
    inlet
    {
        type            fixedValue;
        value           0.017;
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
