tutorials/adsorbTestProblem/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    R2NH
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  DILU;
        }

        tolerance        1e-6;
        relTol           0;
    };

    R2NH2p
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  DILU;
        }

        tolerance        1e-6;
        relTol           0;
    };

    R2NHCO2m
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  DILU;
        }

        tolerance        1e-6;
        relTol           0;
    };

    HCO3m
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  DILU;
        }

        tolerance        1e-6;
        relTol           0;
    };
    
    heatSource
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  DILU;
        }

        tolerance        1e-8;
        relTol           0;
    };
    
    
    
    CO2
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  DILU;
        }

        tolerance        1e-6;
        relTol           0;
    };
    H2O
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  DILU;
        }

        tolerance        1e-6;
        relTol           0;
    };
       

    T
    {
        solver           BiCGStab;
        
        preconditioner      
        {                   
            preconditioner  DILU;
        }

        tolerance        1e-6;
        relTol           0;
    };
    

}

SIMPLE
{
    nNonOrthogonalCorrectors 3;

    residualControl
    {
        T               1e-6;
        CO2             1e-6;
        H2O             1e-6;
        
    }
}

PISO
{
    pRefPoint (0 0 0); 
    pRefValue 0;
}

PIMPLE
{
    // p-U coupling
    //nOuterCorrectors            3; // SIMPLEC loops, see constant/fvSolution
    nCorrectors                 2; // PISO loops
    nNonOrthogonalCorrectors    1;

    residualControl
    {
        p
        {
            relTol         0;
            tolerance      0;
        }

        U
        {
            relTol         0;
            tolerance      0;
        }
    }
}

relaxationFactors
{
	T	1.0;

}



// ************************************************************************* //
